In [1]:
import pandas as pd
import numpy as np

In [2]:
dictData = {"City A" : [30, 29, np.nan], "City B" : [20, np.nan, 25], "City C" : [40, 39, 38]}
weatherDataFrame = pd.DataFrame(dictData)

In [6]:
weather = ["Weather 1", "Weather 2", "Weahter 3"]

In [11]:
weatherDataFrame

   City A  City B  City C
0    30.0    20.0      40
1    29.0     NaN      39
2     NaN    25.0      38

In [13]:
weatherDataFrame["Weather"] = weather

In [14]:
weatherDataFrame

   City A  City B  City C    Weather
0    30.0    20.0      40  Weather 1
1    29.0     NaN      39  Weather 2
2     NaN    25.0      38  Weahter 3

In [17]:
weatherDataFrame.set_index("Weather", inplace = True)

In [18]:
weatherDataFrame

           City A  City B  City C
Weather
Weather 1    30.0    20.0      40
Weather 2    29.0     NaN      39
Weahter 3     NaN    25.0      38

In [19]:
weatherDataFrame.dropna()

           City A  City B  City C
Weather
Weather 1    30.0    20.0      40

In [20]:
weatherDataFrame.dropna(axis = 1)

           City C
Weather
Weather 1      40
Weather 2      39
Weahter 3      38

In [42]:
newDictData = {"City A" : [30, 29, np.nan], "City B" : [20, np.nan, 25], "City C" : [40, 39, 38], "City D" : [45, np.nan, np.nan]}
newDataFrame = pd.DataFrame(newDictData)

In [43]:
newDataFrame["Weather"] = weather

In [44]:
newDataFrame.set_index("Weather", inplace = True)

In [45]:
newDataFrame.dropna(axis = 1, thresh = 2)

           City A  City B  City C
Weather
Weather 1    30.0    20.0      40
Weather 2    29.0     NaN      39
Weahter 3     NaN    25.0      38

**thresh = 2 dediğimizde 2 ve üzeri NaN değer olan kolonları attı.**

In [46]:
newDataFrame

           City A  City B  City C  City D
Weather
Weather 1    30.0    20.0      40    45.0
Weather 2    29.0     NaN      39     NaN
Weahter 3     NaN    25.0      38     NaN

* NaN yazan yerleri doldurmak için;

In [47]:
newDataFrame.fillna(20)

           City A  City B  City C  City D
Weather
Weather 1    30.0    20.0      40    45.0
Weather 2    29.0    20.0      39    20.0
Weahter 3    20.0    25.0      38    20.0